In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame( {"workers": ["adam","bob","charles","David"],
                     "group": ["engineer","lawyer","lawyer","hr"]})

In [3]:
df1

   workers     group
0     adam  engineer
1      bob    lawyer
2  charles    lawyer
3    David        hr

In [4]:
df2 = pd.DataFrame(  {"workers": ["adam","bob","charles","David"],
                     "year": [1990,1995,2001,1994]}  )

In [5]:
df2

   workers  year
0     adam  1990
1      bob  1995
2  charles  2001
3    David  1994

In [6]:
pd.merge(df1,df2)

   workers     group  year
0     adam  engineer  1990
1      bob    lawyer  1995
2  charles    lawyer  2001
3    David        hr  1994

In [7]:
pd.merge(df1,df2, on="workers")

   workers     group  year
0     adam  engineer  1990
1      bob    lawyer  1995
2  charles    lawyer  2001
3    David        hr  1994

In [8]:
df3 = pd.merge(df1,df2)

In [9]:
df3

   workers     group  year
0     adam  engineer  1990
1      bob    lawyer  1995
2  charles    lawyer  2001
3    David        hr  1994

In [10]:
df4 = pd.DataFrame( {"group": ["lawyer","engineer","hr"],
                     "manager" : ["kevin","bratt","john"] }   )

In [11]:
df4 #many to one many=df3 one=df4

      group manager
0    lawyer   kevin
1  engineer   bratt
2        hr    john

In [12]:
pd.merge(df3,df4)

   workers     group  year manager
0     adam  engineer  1990   bratt
1      bob    lawyer  1995   kevin
2  charles    lawyer  2001   kevin
3    David        hr  1994    john

In [14]:
# many to many
df5 = pd.DataFrame( {"group":["engineer","engineer","lawyer","lawyer","hr","hr"],
                    "ability" : ["math","math","excellMS","coding","linux","management"]} )

In [15]:
df5

      group     ability
0  engineer        math
1  engineer        math
2    lawyer    excellMS
3    lawyer      coding
4        hr       linux
5        hr  management

In [16]:
pd.merge(df1,df5)

   workers     group     ability
0     adam  engineer        math
1     adam  engineer        math
2      bob    lawyer    excellMS
3      bob    lawyer      coding
4  charles    lawyer    excellMS
5  charles    lawyer      coding
6    David        hr       linux
7    David        hr  management